from aiogram import types

from loader import bot, db


async def colorfulmasterbatchAlone():
    photos = 'photos/colorfulmasterbatch.jpeg'
    caption = '''
🇲 🇦 🇸 🇹 🇪 🇨

🟧🟨🟩🟦⬛️🟪⬜️🟫
🔹 <i>Различные красочные варианты, великолепные цветные мастербатчи  придают вашим продуктам бесконечную жизненную силу. Служба точного подбора цветов обеспечивает блестящее цветовое решение, поэтому вам не нужно беспокоиться о продуктах, изготовленных по индивидуальному заказу.</i> 

<b>❗️<a href='https://t.me/mastecuz'>MASTEC</a> может предоставить вам высококачественные услуги по подбору цвета с функциональными продуктами, чтобы придать цвет вашим продуктам, а также добиться отличных характеристик.

Используются для : 
- Пакетов и пленок 
- Труб и фитингов
- Игрушек 
- Пробок
- И других пластиковых изделие </b>

📞 Менеджер : <a href='https://t.me/tel998977277900'>Одил</a> 
Контакы +998 97 7277900
+998 97 700 1991
www.mastec.uz

T.me/mastecuz 
    '''
    with open(photos, 'rb') as photo_file:
        photo = types.InputFile(photo_file)
        await bot.send_photo(chat_id="-1001921502461", photo=photo, caption=caption)


async def opticwhitenerAlone():
    message = types.Message
    photos = 'photos/opticwhitener.jpeg'
    caption = '''
🇲 🇦 🇸 🇹 🇪 🇨

<i>❗️Важный нюанс в полимерном производстве — сохранение эстетических свойств получаемой продукции. Чтобы материал отличался насыщенным и чистым цветом, используется оптический отбеливатель. Данная добавка отражает лучи фиолетовый части спектра, способствуя усилению белизны материала.А также имеются виде гранулы</i>

<b>🔹Пигмент используется для придания белого цвета и избавления желтизны при производстве изделий из следующих материалов:

-ПВХ
-Полиолефины
-Поликарбонат, полиакрилат, полиуретан
-Лакокрасочные изделия

🔹Гранула  используется для придания белого цвета и избавления желтизны при производстве изделий из следующих материалов:

-ПВХ пластика
-Полиолефины
-Поликарбонат, полиакрилат, полиуретан
-Лакокрасочные изделия </b>

📞 Менеджер :  <a href='https://t.me/tel998977277900'>Одил</a> 
Контакы +998 97 7277900
+998 97 700 1991
www.mastec.uz

T.me/mastecuz

    '''
    with open(photos, 'rb') as photo_file:
        photo = types.InputFile(photo_file)
        await bot.send_photo(chat_id="-1001921502461", photo=photo, caption=caption)


async def organic_pigmentsAlone():
    message = types.Message
    photos = 'photos/organicpigments.jpeg'
    caption = '''
<b>♻️ Органические пигменты - это отдельные вещества, которые присутствуют в различных средах, таких как производство красок, пластиков, текстиля, косметики и многих других. Они обладают высокой яркостью, чистотой цвета, что делает их видимыми выбор для создания красивых и ярких изделий.

Если вы ищете качественные органические пигменты для вашего бизнеса, то вы попали по адресу. Наша компания уже много лет занимаются импортом органических пигментов, которые отличаются яркой и насыщенной окраской.

🔹Пигменты  используется для придания  цвета при производстве изделий для следующих материалов:

-Мастербатча
-ПВХ пластика
-Полимерных продукций 
-Лакокрасочной продукций</b>

📞 Менеджер : <a href='https://t.me/tel998977277900'>Одил</a> 
Контакы +998 97 7277900
+998 97 700 1991
www.mastec.uz

T.me/mastecuz

    '''
    with open(photos, 'rb') as photo_file:
        photo = types.InputFile(photo_file)
        await bot.send_photo(chat_id="-1001921502461", photo=photo, caption=caption)


async def ufStabilizatorAlone():
    message = types.Message
    photos = 'photos/ufstabilazator.jpeg'
    caption = '''
🇲 🇦 🇸 🇹 🇪 🇨

<i>Существует несколько видов модификаторов для полимеров. Модификатор выпускаемый нашей фирмой усиливает стойкость к ультрафиолетовому лучу и удлиняет срок действия полимера в несколько раз.

Наш модификатор уже прошел испытание в Центрально-азиатском климате и клиенты уже несколько лет довольны результатом нашей продукции.</i>

📞 Менеджер : <a href='https://t.me/tel998977277900'>Одил</a> 
Контакы +998 97 7277900
+998 97 700 1991
www.mastec.uz

T.me/mastecuz

    '''
    with open(photos, 'rb') as photo_file:
        photo = types.InputFile(photo_file)
        await bot.send_photo(chat_id="-1001921502461", photo=photo, caption=caption)


async def whiteMasterbatchAlone():
    photos = 'photos/whitemasterbatch.jpeg'
    caption = '''
🇲 🇦 🇸 🇹 🇪 🇨

<b>🎯 Производства белого мастербатча  по немецкой технологии от MASTEC</b>

<i>👌🏻 Основываясь на каждом из запросов клиентов, наши белые суперконцентраты различаются по содержанию пигмента, которое колеблется от 20% до более 60%, в сочетании с полиэтиленовой смолой PE и подобранными вручную добавками для каждого времени работы машины. Кроме того, наша белая маточная смесь обладает широким спектром свойств, таких как, помимо прочего, устойчивость к ультрафиолетовому излучению, антистатичность, антибактериальность, повышение непрозрачности и белизны, защита от фибрилляции и повышение термостойкости, а также возможность обработки при температуре от 150 до 280°С.</i>

<b>Используются для : 
- Пакетов и пленок 
- Труб и фитингов
- Игрушек 
- Пробок
- И других пластиковых изделие</b>

📞 Менеджер :<a href='https://t.me/tel998977277900'>Одил</a> 
Контакы +998 97 7277900
+998 97 700 1991
mastec.uz

    '''
    with open(photos, 'rb') as photo_file:
        photo = types.InputFile(photo_file)
        await bot.send_photo(chat_id="-1001921502461", photo=photo, caption=caption)





